0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.02E6;

boundaryField
{
     

    inlet_air
    {
	type            fixedFluxPressure;
        value           $internalField;
    }

   inletliquid
    {
	type            fixedFluxPressure;
        value           $internalField;
    }

    outlet
    {
		 
      type            totalPressure;
        p0              uniform 1.02E6;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1; 
        value           uniform 1.02E6;
    
    }
   
    walls
    {
       type            fixedFluxPressure;
        value           $internalField;
    }
    
   
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
