constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Numerical simulation of bubble growth in film boiling using a coupled
//level-set and volume-of-fluid method
//Autors: G. Tomar and etc

// for critical water at near critical pressure Pr=0.99



phaseChangeTwoPhaseMixture Hardt;

pSat             pSat       [1 -1 -2 0 0 0 0]   1.02E6;
       			 	
TSat		TSat	    [0 0 0 1 0]	313.15;//add saturation temprature
R               R   [0 2 -2 -1 0 0 0]     81.49; //add
TSatLocal       false;

Hfg		Hfg	[0 2 -2 0 0] 163020;//add  J/kg

sigma           sigma [1 0 -2 0 0 0 0] 0.0061268;

phase1
{
    transportModel Newtonian;
    nu              nu  [0 2 -1 0 0 0 0]    1.4079e-7; //46.7e-6/402.4
    rho             rho [1 -3 0 0 0 0 0]    1146.7;
    C		    C   [0 2 -2 -1 0 0 0]   1498.4;//add
    K		    K   [1 1 -3 -1 0 0 0]   0.074716;//add
}

phase2
{
    transportModel Newtonian;
    nu              nu  [0 2 -1 0 0 0 0]   2.47e-7;//1.33e-07;//32.38e-6/242.7
    rho             rho [1 -3 0 0 0 0 0]   50.085;
    C		    C   [0 2 -2 -1 0 0 0]  1144.5;//look
    K		    K   [1 1 -3 -1 0 0 0]  0.0154;//add
}
HardtCoeffs
{
   Cv            Cv   [0 0 0 0 0 0 0]    1; 
   rv            rv   [0 0 0 0 0 0 0]    0;
   rc            rc   [0 0 0 0 0 0 0]    1; 
}

LeeCoeffs
{
  r            r   [0 0 -1 0 0 0 0]    1000;//100; //add
}
FourierCoeffs {}
// ************************************************************************* //
